In [79]:
import json
import pandas as pd
import mysql.connector
from zipfile import ZipFile
from datetime import date, datetime

In [56]:
data = pd.read_json('../sql/schemas/user_address.json')
data

  column_name   column_type  is_primary_key  is_unique is_null_able
0  first_name  varchar(256)           False      False     NOT NULL
1   last_name  varchar(256)           False      False     NOT NULL
2       email  varchar(256)           False      False     NOT NULL
3     address  varchar(256)           False      False     NOT NULL
4  created_at     timestamp           False      False     NOT NULL

In [58]:
data.drop(['is_primary_key', 'is_unique'], axis=1, inplace=True)

In [59]:
schema_list = []
for i, row in data.iterrows():
    row = tuple(row.astype("string"))
    row_str = ' '.join(list(row))
    schema_list.append(row_str)

query = """
CREATE TABLE if not exists user_address (
"""
for i, schema in enumerate(schema_list):
    query += schema
    if i < len(schema_list) - 1:
        query += ','
query += ')'
query

'\nCREATE TABLE user_address (\nfirst_name varchar(256) NOT NULL,last_name varchar(256) NOT NULL,email varchar(256) NOT NULL,address varchar(256) NOT NULL,created_at timestamp NOT NULL)'

In [60]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Sukses37",
  database="shipping_orders"
)
mycursor = mydb.cursor()

In [61]:
# Execute DDL
mycursor.execute(query)

In [75]:
data.column_name.tolist()

['first_name', 'last_name', 'email', 'address', 'created_at']

In [107]:
# read zip file
zf = ZipFile('../temp/dataset-small.zip')
df = pd.read_csv(
    zf.open('dataset-small.csv'), 
    header=None, names=data.column_name.tolist(), 
    parse_dates=['created_at'])
df.created_at = pd.to_datetime(df.created_at).dt.tz_localize(None)
df.head()

,first_name,last_name,email,address,created_at
0,Cawuk,Tarihoran,sabriaryani@perum.edu,"Jalan Jakarta No. 7Semarang, Nusa Tenggara Ti...",2018-08-10 20:48:35.506
1,Darmaji,Januar,jwahyudin@yahoo.com,"Gang Soekarno Hatta No. 27Payakumbuh, Maluku U...",2018-06-17 19:31:04.314
2,Bahuraksa,Mansur,zulfaharyanti@pd.sch.id,"Jl. Raya Ujungberung No. 2Palembang, Maluku Ut...",2018-10-28 11:20:50.360
3,Among,Simanjuntak,kusuma67@perum.id,"Jalan Cikutra Timur No. 03Tanjungpinang, Papua...",2018-10-26 00:47:32.831
4,Calista,Najmudin,gastiutama@gmail.com,Jalan Asia Afrika No. 589Kota Administrasi Jak...,2018-12-14 17:09:49.514

In [108]:
# filter data created at '2018-02-01' until '2018-12-31'
df_filtered = df[(df.created_at >= datetime(2018,2,1)) & (df.created_at <= datetime(2018,12,31))]
df_filtered.head()

,first_name,last_name,email,address,created_at
0,Cawuk,Tarihoran,sabriaryani@perum.edu,"Jalan Jakarta No. 7Semarang, Nusa Tenggara Ti...",2018-08-10 20:48:35.506
1,Darmaji,Januar,jwahyudin@yahoo.com,"Gang Soekarno Hatta No. 27Payakumbuh, Maluku U...",2018-06-17 19:31:04.314
2,Bahuraksa,Mansur,zulfaharyanti@pd.sch.id,"Jl. Raya Ujungberung No. 2Palembang, Maluku Ut...",2018-10-28 11:20:50.360
3,Among,Simanjuntak,kusuma67@perum.id,"Jalan Cikutra Timur No. 03Tanjungpinang, Papua...",2018-10-26 00:47:32.831
4,Calista,Najmudin,gastiutama@gmail.com,Jalan Asia Afrika No. 589Kota Administrasi Jak...,2018-12-14 17:09:49.514

In [109]:
cols = "`,`".join([str(i) for i in df_filtered.columns.tolist()])

for i, row in df_filtered.iterrows():
    sql = "INSERT INTO `user_address` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    mycursor.execute(sql, tuple(row))

    mydb.commit()

c:\Users\agung\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement